# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
##############################################
# st = '1 2 8 jhhfhcg 22'
# string = []
# print(st)
# for i in st:
#     if i.isdigit():
#         string.append(int(i))
# print(string)
##############################################
# написати прогу яка вибирає зі введеної строки числа і виводить їх
##############################################
# так як вони написані
# import re
# st = '44, 1, ghf, 22, ngff, 12, 6'
# number = []
# st2 = re.findall('[0-9]+', st)
# print(st2)
# for i in st2:
#     number.append(int(i))
# print(number)
##############################################
# есть строка:
# greeting = 'Hello, world'
# записать каждый символ в лист поменяв его на верхний регистр
# greeting = 'Hello, world'
# for i in greeting:
#     print(i.upper())
##############################################
# с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
##############################################
# l = [i **2 for i in range(50) if i % 2 != 0]
# print(l)
##############################################
# function
###############################################
# - створити функцію яка виводить ліст
# def l():
#     print(l)
#
#
# l()
##############################################
# - створити функцію яка приймає три числа та виводить та повертає найменьше.
# def func(*args):
#     print(min(args))
#     return min(args)
# func(1, 5, 4)
##############################################
# - створити функцію яка приймає три числа та виводить та повертає найбільше.
# def func_one(*args):
#     print(max(args))
#     return max(args)
# func_one(7, 12, 8)
##############################################
# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
# def func_min_max(*args):
#     print(max(args))
#     return min(args)
# func_min_max(6, 33, 12, -5, 99)

##############################################
# - створити функцію яка повертає найбільше число з ліста

##############################################
# - створити функцію яка повертає найменьше число з ліста

##############################################

# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
# def func_sum(*args):
#     print(sum(args))
#     return sum(args)
# func_sum(5, 2, 33, 12)
##############################################
# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.
# def func_math(*args):
#     print(sum(args)/len(args))
# func_math(4, 5, 6)
##############################################

##############################################
# Дан лист:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
#   - найти min число в листе
#   - удалить все дубликаты в листе
#   - заменить каждое четвертое значение на "Х"

# list = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]
# print(min(list))
#
# list1 = []
# for l in list:
#     if l not in list1:
#         list1.append(l)
#
# print(list1)
#
# for l in range (len(list)):
#     if l%4==0:
#         list[l]= 'X'
# print(list)

##############################################

# вывести на экран пустой квадрат из "*" сторона которого указана в переменой:
# def square(a):
#    print(['*' + '' * (a - 2) + a] *a)
# square(1)


#  вывести табличку умножения с помощью цикла while
# for i in range(1, 10):
#     print(''.join(str(i * a) for a in range(1, 10)))

# переделать первое задание под меню с помощью цикла
